Repository: hhwfsl/AnimeGirlsDownloader
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# AppTitle_TextBlock.Text
source: Anime Girls Downloader
ja_jp: Anime Girls ダウンローダー

# ChangeTheme_Button.ToolTipService.ToolTip
source: Change theme
ja_jp: テーマを切り替える

# SaveImage_Button.ToolTipService.ToolTip
source: Download image
ja_jp: 画像をダウンロード

# OpenSavingPath_Button.ToolTipService.ToolTip
source: Open saving folder
ja_jp: 保存フォルダを開く

# Refresh_Button.ToolTipService.ToolTip
source: Refresh image
ja_jp: 画像を更新

# Setting_Button.ToolTipService.ToolTip
source: Settings
ja_jp: 設定

# IsEnableNSFW_CheckBox_Checked
source: Image Type: NSFW Only
ja_jp: 画像タイプ：NSFWのみ

# IsEnableFixedSavingPath_CheckBox.Content
source: Use specified saving path
ja_jp: 指定された保存パスを使用する

# SavingPath_TextBlock.Text
source: Saving path:
ja_jp: 保存パス:

# PathSelectButtonBrowse_TextBlock.Text
source: Browse
ja_jp: 閲覧

# ResizeWindowButtonResizeToDefaultSize_TextBlock.Text
source: Resize window to default size
ja_jp: ウィンドウをデフォルトサイズに戻す

# ChangeLanguage_TextBlock.Text
source: Select language(Active after restart)
ja_jp: 言語を選択(再起動後に有効)

# SourceWeb_TextBlock.Text
source: Source web
ja_jp: 元のウェブサイト

# RepositoryAddress_TextBlock.Text
source: Repository address
ja_jp: リポジトリのアドレス

# CopyImage_MenuFlyoutItem.Text
source: Copy Image
ja_jp: コピー

# Info_Downloader_GetImageBytesById_1
source: Begin to get image bytes by id. Id=
ja_jp: 画像IDに基づいて画像データの取得を開始します。Id=

# Info_Downloader_GetImageId_1
source: Getting image id completed. Id=
ja_jp: 画像IDの取得が完了しました。Id=

# Info_Downloader_GetRandomImage_1
source: Begin to get random image. URL=
ja_jp: ランダム画像の取得を開始します。URL=

# Error_MainWindow_BytesToBitmapImage_1
source: Received empty data, meow. BitmapImage conversion failed. Please check your network connection and try again, meow~
ja_jp: 空データを受け取りましたニャ、BitmapImageの変換に失敗しました。ネットワーク接続を確認して、もう一度試してくださいニャ〜

# Error_MainWindow_GetRandomImage_1
source: The image is being retrieved, please wait a moment, meow~
ja_jp: 画像を取得中です、少々お待ちくださいニャ〜

# Error_MainWindow_SaveImage_1
source: The image data is empty, save failed meow~
ja_jp: 画像データが空です、保存に失敗しましたニャ〜

# Info_MainWindow_SaveImage_1
source: Saving image completed. Saving path=
ja_jp: 画像の保存が完了しました。保存先のパスは：

# Success_MainWindow_SaveImage_1
source: Saved successfully, meow~
ja_jp: 保存成功にゃ〜

# Error_MainWindow_CopyImageToClipBoard_1
source: Received null or empty image data, failed to copy to clipboard meow~
ja_jp: 空の画像データを受け取ったので、クリップボードへのコピーに失敗しましたにゃ〜

# Error_MainWindow_OpenSavingPathButtonClick_1
source: The save path is empty, failed to open meow~. Please check if the "Use specified saving path" option is enabled and a folder is selected meow~
ja_jp: 保存先のパスが空で、開けませんでしたにゃ〜。設定で「指定された保存パスを使用する」が有効になっていて、フォルダが選ばれているか確認してくださいにゃ〜

# Error_SettingPage_LanguageListComboBoxSelectionChanged_1
source: The selected language is empty, meow~
ja_jp: 選択された言語が空ですにゃ〜

# Success_MainWindow_CopyImageToClipBoard_1
source: Image copyied successful, meow~
ja_jp: コピー成功ニャ〜

# EditUserAvatar_MenuFlyoutItem.Text
source: Edit avatar
ja_jp: プロフィール画像を変更する

# EditUserName_MenuFlyoutItem.Text
source: Edit name
ja_jp: 名前を変更

# Warning_SettingPage_UserNameTextBoxLostFocus_1
source: Name cannot be empty meow~
ja_jp: 名前は空にできニャ〜

# LoginButton_TextBlock.Text
source: Log in
ja_jp: ログイン

# LogoutButton_TextBlock.Text
source: Log out
ja_jp: ログアウト

# Login_TextBlock.Text
source: Log In
ja_jp: ログイン

# LoginAccount_TextBlock.Text
source: User Name
ja_jp: ユーザー名

# LoginPassword_TextBlock.Text
source: Password
ja_jp: パスワード

# LoginPageLoginButton_TextBlock.Text
source: Log In
ja_jp: ログイン

# LoginPageTip_TeachingTip_Tip
source: Tips
ja_jp: 提示

# LoginPageTip_TeachingTip_Subtitle
source: User name or password cannot be empty
ja_jp: ユーザー名またはパスワードを入力してください

# LoginPageError_TeachingTip_Title
source: Error
ja_jp: エラー

# LoginPageError_TeachingTip_Subtitle
source: Operation failed
ja_jp: 操作に失敗しました

# LoginPageRegistButton_TextBlock.Text
source: Register
ja_jp: 登録

# LoggedAccount_TextBlock.Text
source: Logged in to:
ja_jp: ログイン済み：

# LoginPageSuccess_TeachingTip_Title
source: Success
ja_jp: 成功

# LoginPageSuccess_TeachingTip_Subtitle_Register
source: Registration Successful
ja_jp: 登録に成功しました

# LoginPageSuccess_TeachingTip_Subtitle_Login
source: Login Successful
ja_jp: ログイン成功

# UploadImage_Button.ToolTipService.ToolTip
source: Upload image
ja_jp: 画像をアップロード

# RevokeTagButton_TextBlock.Text
source: Revoke
ja_jp: 取り消す

# AddTagButton_TextBlock.Text
source: Add
ja_jp: 追加

# Tag_AutoSuggestBox.PlaceholderText
source: Enter a tag(Up to 10)
ja_jp: タグを入力してください（最大10個）

# IsNSFW_CheckBox.Content
source: Is it NSFW?
ja_jp: NSFWですか？

# CreatorName_TextBlock.Text
source: Creator:
ja_jp: クリエイター：

# UploadButton_TextBlock.Text
source: Upload
ja_jp: アップロード

# DropImage_TextBlock.Text
source: Drag the image here
ja_jp: ここに画像をドラッグしてください

# ImageDragOver
source: Insert image
ja_jp: 画像を挿入

# UploadPageTip_TeachingTip.Title
source: Infomation
ja_jp: 情報

# CancelUploadButton_TextBlock.Text
source: Cancel
ja_jp: キャンセル

# IsEnableNSFW_CheckBox_Unchecked
source: Image Type: SFW Only
ja_jp: 画像タイプ：SFWのみ

# IsEnableNSFW_CheckBox_Indeterminate
source: Image Type: Everything is OK
ja_jp: 画像の種類：すべての種類が可能

# SearchTags_AutoSuggestBox.PlaceholderText
source: Search images
ja_jp: 画像を検索

# IsAiGenerate_CheckBox.Content
source: Is this AI-generated?
ja_jp: AIによって生成されたものですか

# BatchUploadButton_TextBlock.Text
source: Batch upload
ja_jp: まとめてアップロード

# Info_UploadImagePage_BatchUpload_1
source: Upload complete. A total of {0} images, {1} succeeded, {2} failed
ja_jp: アップロード完了。全部で{0}枚の画像、成功は{1}枚、失敗は{2}枚
